[
{"description": "NEW YORK (AP) — Drew Smith underwent Tommy John surgery with an internal brace procedure Friday, likely knocking the New York Mets reliever out of action until 2026.", "category": "sports"},
{"description": "Drew Smith has undergone Tommy John surgery with an internal brace procedure. That likely knocks the New York Mets reliever out of action until 2026. Smith is slated to hit free agency after this season. He last pitched June 23,...", "category": "sports"},
{"description": "Drew Smith has undergone Tommy John surgery with an internal brace procedure. That likely knocks the New York Mets reliever out of action until 2026. Smith is slated to hit free agency after this season. He last pitched June 23,...", "category": "sports"},
{"description": "The long-anticipated bout takes place in November Leer", "category": "sports"},
{"description": null, "category": "sports"},
{"description": "Colin Montgomerie faced the iconic sportsman in the Ryder Cup Leer", "category": "sports"},
{"description": null, "category": "sports"},
{"description": "We have heart from cats and meerkats on England's Euro final hopes. but now we turn to the usual food-nicking pests, seagulls, to bring us even more hope of a Three Lions victory", "category": "sports"},
{"description": "Paul George recently signed with the Philadelphia 76ers after spending five years with the Los Angeles Clippers. Following the trade, many believed that George’s relationship with teammate, Kawhi Leonard would also turn sour as the LA franchise showed much more intent in retaining the two-time NBA Champion. However, the two former teammates were recently seen...The post Footage of Paul George Hanging Out with Kawhi Leonard in Vegas Night Club Surfaces on Twitter appeared first on The SportsRush.", "category": "sports, sports, sports, sports"},
{"description": "SPOILER ALERT: This story contains major spoilers about “Longlegs,” now playing in theaters. Even before its release, critics and horror fans who saw director Osgood Perkins’ serial killer thriller “Longlegs” praised it as one of the darkest, most sinister movies in recent memory. Now that the film is finally in theaters, audience members can check [...]", "category": "entertainment"}
]